#+OPTIONS: toc:nil

* Multiples of 3 and 5

** Task

If we list all the natural numbers below 10 that are multiples of 3 or 5,
we get 3, 5, 6 and 9. The sum of these multiples is 23.

Find the sum of all the multiples of 3 or 5 below 1000.

** Solution

#+BEGIN_SRC python :results output :exports both
result = 0
for i in range(0, 1000):
    if i % 3 == 0 or i % 5 == 0:
        result += i
print(result)
#+END_SRC

#+RESULTS:
: 233168
